package ru.telegrambot.bot.dataEnum;

public class LongMessages {

public static final String START_MESSAGE = "Привет дорогой пользователь! \n\n Данный бот позволяет разработчикам собрать базу данных для создания нейросети." +
        "\n Для обучения искусственного интеллекта нам необходимы предложения, где вы описываете свои повседневные достижения в мире спорта и околоспорта. Чтобы было понятно приведу примеры: 'Ура, сегодня я впервые подтянулся 10 раз'," +
        " 'Сегодня я вместо поездки на такси прошелся пешком', 'Вместо того просмотра ужастика с пиццей, я решил делать домашнее задания, поедая только зеленные овощи'." +
        "\n \n **Но все же есть критерии к вашим сообщениям**" +
        "\n 1. Путь ваши достижения будут +-реалистичны. Не стоит писать ахинею(Мы ведем черный список)" +
        "\n 2. Разделяйте несколько достижений на несколько сообщений" +
        "\n 3. Можете писать выдуманные  РЕАЛИСТИЧНЫЕ достижения" +
        "\n \n В заключение хотим заранее поблагодарить всех, кто поможет в развитии проекта!";

public static final String SEND_TO_US = "По всем вопросам пишите: \n" +
        "@Syrnick - Павел (ему не пишите)" +
        "\n @kartbllansh - Артем (Во мужик! Зуб даю!)" +
        "\n @so_Andrey - Андрей (Он вам не ответит. ЗУб не даю)";
}
