package ru.telegrambot.bot.dataEnum;

public class LongMessages {

    public static final String START_MESSAGE = """
            Привет, дорогой пользователь!\s

            Добро пожаловать в наш бот, который помогает разработчикам собирать данные для создания передовой нейросети.

            Для обучения искусственного интеллекта нам нужны ваши ежедневные достижения в спорте и околоспортивной жизни. Это может быть что угодно: от больших побед до небольших шагов на пути к здоровому образу жизни. Вот несколько примеров: 'Сегодня я впервые подтянулся 10 раз', 'Сегодня я прошел пешком вместо поездки на такси', 'Вместо просмотра фильма с пиццей я сделал домашнее задание, поедая только зеленые овощи'.

            Почему это важно? Ваши сообщения помогут нам создать умную нейросеть, которая сможет помогать людям достигать своих целей и улучшать их жизнь. И что самое важное, все данные собираются анонимно, мы не знаем, кто что написал.

            Критерии для ваших сообщений:
            1. Пусть ваши достижения будут реалистичными. Не пишите бессмыслицу.
            2. Разделяйте несколько достижений на отдельные сообщения. Одно достижение = одно сообщение.
            3. Вы можете писать выдуманные, но реалистичные достижения.
            4. Делитесь и неудачами. Если вы две недели придерживались здорового питания, а сегодня сорвались, напишите об этом.

            Каждое ваше сообщение делает нашу нейросеть умнее и приближает нас к общей цели. Ваша помощь ценна для нас, и в знак благодарности мы подарим доступ к нашей нейросети всем, кто активно участвует в проекте. Честное пионерское!

            Спасибо, что помогаете нам! Напишите свое достижение прямо сейчас и внесите свой вклад в будущее технологий!""";


    public static final String SEND_TO_US = "По всем вопросам пишите: \n" +
        "@Syrnick - Павел (ему не пишите)" +
        "\n @kartbllansh - Артем (Во мужик! Зуб даю!)" +
        "\n @so_Andrey - Андрей (Он вам не ответит. ЗУб не даю)";

    public static final String CHECK_MESSAGE = "Работает все, сука! Сырник ахуел!";
}
